export const skills = {
  "HTML/CSS/JS":
    "複雑なアニメーションやUIは作れませんが、基本的なデザインは対応可能です。\n当サイトもNuxt.jsを含めたこれらの技術を利用しています。",
  "Vue/Nuxt": [
    "業務で2~3年利用しています。当サイトもNuxt3を利用しています。",
    "実務で実装やレビューをする際は不必要に状態管理をしないように意識しています。",
  ].join("\n"),
  "React/Next": [
    "副業で利用しています。",
    "レンダリング時におけるVueとの挙動の違いを理解し、不必要なレンダリングが発生しないように意識しています。",
  ].join("\n"),
  TypeScript: [
    "副業で利用しています。",
    "意図せぬミスを防ぐ目的だけでなく、他の人が実装する際のガイドとなるように意識しています。",
  ].join("\n"),
  "Ruby/Rails": [
    "業務で2~3年APIとして利用しています。",
    "複雑なロジックになるほど変数名や関数の単位を注意し、メンテしやすいように意識しています。",
  ].join("\n"),
  "Node.js": ["NuxtのサーバーやLambdaの実行環境として利用しています。"].join(
    "\n"
  ),
  Python: ["業務でのバッチ処理や業務ツールの作成に利用しています。"].join("\n"),
  AWS: [
    "業務で利用しています。",
    "最新のプロジェクトではVPCの構築からECSへのデプロイまでを一人で対応しました",
  ].join("\n"),
  Docker: [
    "業務で利用しています。",
    "仮想化の細かい仕組みなどはよく分かっていません。。",
  ].join("\n"),
  Git: [
    "初めの頃はプログラミング以上に泣かされることがありましたが、最近はGitで困ることはなくなった気がします。",
    "CUI派です。",
  ].join("\n"),
  CDK: [
    "AWS CDK",
    "現在の会社で初となるIaCをTypeScriptで実現しました。",
    "VPCの作成やCodeDeployによるECSのBlue/Greenデプロイを実装しました",
  ].join("\n"),
};
