export const skills = {
  "HTML/CSS/JS":
    "複雑なアニメーションやUIは作れませんが、基本的なデザインは対応可能です。\n当サイトもNuxt.jsを含めたこれらの技術を利用しています。",
  "Vue/Nuxt": [
    "業務で2~3年利用しています。当サイトもNuxt3を利用しています。",
    "実務で実装やレビューをする際は不必要に状態管理をしないように意識しています。",
  ].join("\n"),
  "React/Next": [
    "副業で利用しています。",
    "レンダリング時におけるVueとの挙動の違いを理解し、不必要なレンダリングが発生しないように意識しています。",
  ].join("\n"),
  TypeScript: [
    "副業で利用しています。",
    "意図せぬミスを防ぐ目的だけでなく、他の人が実装する際のガイドとなるように意識しています。",
  ].join("\n"),
  "Ruby/Rails": [
    "業務で2~3年APIとして利用しています。",
    "複雑なロジックになるほど変数名や関数の単位を注意し、メンテしやすいように意識しています。",
  ].join("\n"),
  "Node.js": ["NuxtのサーバーやLambdaの実行環境として利用しています。"].join(
    "\n"
  ),
};
